kcaluwae/dspic33e-bootloader/dspic_bootloader/bootloader.c
/*
 * CAN(CANopen) and UART bootloader for the dsPIC33E.
 *
 * The UART section of this file is loosely based on the AN1094 application
 * note from Microchip, which is available at:
 * http://www.microchip.com/stellent/idcplg?IdcService=SS_GET_PAGE&nodeId=1824&appnote=en530200
 *
 * The CAN implementation is not fully CANopen compliant, but is expected to
 * be compatible with most CANopen implementations (tested using CANfestival).
 *
 * Ken Caluwaerts 2014 <ken@caluwaerts.eu>
 *
 * Copyright © 2014, Ken Caluwaerts
 * All rights reserved.
 *
 * The CAN(CANopen) and UART bootloader for the dsPIC33E bootloader is licensed
 * under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * http://www.apache.org/licenses/LICENSE-2.0.
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
 * either express or implied. See the License for the specific language
 * governing permissions and limitations under the License.
 *
 */
#include <stdint.h>
#include <pps.h>
#include <qei32.h>
#include <xc.h>
#include "bootloader.h"
#include "canbus.h"

_FOSCSEL(FNOSC_FRCPLL & IESO_OFF);
/*PWMLOCK_OFF needed to configure PWM*/
_FOSC(FCKSM_CSECMD & OSCIOFNC_OFF & POSCMD_NONE & IOL1WAY_OFF); //FUCK IOL1WAY!
_FWDT(FWDTEN_OFF);
/* Disable JTAG */
_FICD(JTAGEN_OFF & ICS_PGD2);
_FGS(GCP_OFF); /* Disable Code Protection */


/*defined in memory.s*/
extern uint32_t read_latch(uint16_t, uint16_t);
extern void reset_internal_device();
extern void write_row_pm_33E(uint16_t,uint16_t,ureg32_t*);

void reset_device()
{
    reset_internal_device();
}

/*This buffer is used to write/read program memory internally*/
char buffer[PM_ROW_SIZE * 3 + 1];

#ifndef BL_UART
/*This buffer is used by the CAN code to temporary store program memory*/
uint8_t can_prog_data[PM_ROW_SIZE*3+4];
#endif

int main(void)
 {
    ureg32_t source_addr;
    ureg32_t delay;

    //Set all pins to input
  TRISA = 0xFFFF;
  TRISB = 0xFFFF;
  TRISC = 0xFFFF;
  TRISD = 0xFFFF;
  TRISE = 0xFFFF;
  TRISF = 0xFFFF;
  TRISG = 0xFFFF;

  //Configure all analog ports as digital I/O
  ANSELA = 0x0;
  ANSELB = 0x0;
  ANSELC = 0x0;
  ANSELE = 0x0;

  /*
   * Watchdog
   */
  PTGCONbits.PTGWDT = 0b000; //watchdog disabled

  /*
   * CAN
   */
  TRISCbits.TRISC8 = 0; //TX = output
  _RP56R = 0b001110; //TX
  RPINR26bits.C1RXR = 55; //RX RP55

  //LEDs
  TRISGbits.TRISG6 = 0;
  _RP118R = 0;
  TRISGbits.TRISG8 = 0;
  _RP120R = 0;
  TRISAbits.TRISA0 = 0;
  TRISDbits.TRISD6 = 0;
  TRISDbits.TRISD5 = 0;
  TRISCbits.TRISC13 = 0;
  TRISDbits.TRISD8 = 0;

    /*
     * 70 MIPS:
     * FOSC = Fin*(PLLDIV+2)/((PLLPRE+2)*2(PLLPOST+1))
     * FOSC = 7.37MHz(74+2)/((0+2)*2(0+1)) = 140.03Mhz
     * Fcy = FOSC/2
     */
    PLLFBD = 74;
    CLKDIVbits.PLLPRE = 0;
    CLKDIVbits.PLLPOST = 0;

    // Initiate Clock Switch to FRC oscillator with PLL (NOSC=0b001)
    __builtin_write_OSCCONH(0x01);
    __builtin_write_OSCCONL(OSCCON | 0x01);

    // Wait for Clock switch to occur
    while (OSCCONbits.COSC != 0b001);
    while (OSCCONbits.LOCK!= 1);

    RCONbits.SWDTEN = 0; /* Disable Watch Dog Timer*/

    source_addr.val32 = 0x1000;

    delay.val32 = BOOT_DELAY; //ReadLatch(SourceAddr.Word.HW, SourceAddr.Word.LW);

    if (delay.val[0] == 0) {
        reset_device();
    }

    /*Timer setup */
    T2CONbits.T32 = 1; /* increments every instruction cycle */
    IFS0bits.T3IF = 0; /* Clear the Timer3 Interrupt Flag */
    IEC0bits.T3IE = 0; /* Disable Timer3 Interrup Service Routine */

    if ((delay.val32 & 0x000000FF) != 0xFF) {
        /* Convert seconds into timer count value */
        delay.val32 = ((uint32_t) (FCY)) * ((uint32_t) (delay.val[0]));
        PR3 = delay.word.HW;
        PR2 = delay.word.LW;
        TMR3HLD = 0x0000;
        TMR2 = 0x0000;
        T2CONbits.TON = 1;
    }

    RGB_RED = 1;
    RGB_GREEN = 1;
    RGB_BLUE = 1;
    LED_1 = 1;
    
#ifdef BL_UART
    /* Serial version of the bootloader */
    char command;

    OUT_PIN_PPS_RP68 = OUT_FN_PPS_U2TX; //U2Tx
    IN_FN_PPS_U2RX = IN_PIN_PPS_RP67; //U2Rx

    U2BRG = BRGVAL; /*  BAUD Rate Setting of Uart2  */
    U2MODE = 0x8000; /* Reset UART to 8-n-1, alt pins, and enable */
    U2MODEbits.BRGH = 0;
    U2STA = 0x0400; /* Reset status register and enable TX */

    while (1) {
        get_char(&command);
        switch (command) {
            case COMMAND_WRITE_PM: /* tested */
            {
                int size;
                /*Get the page address*/
                get_char(&(source_addr.val[0]));
                get_char(&(source_addr.val[1]));
                get_char(&(source_addr.val[2]));
                source_addr.val[3] = 0;

                /*Get the page contents*/
                for (size = 0; size < PM_ROW_SIZE * 3; size++) {
                    get_char(&(buffer[size]));
                }
                LED4 = !LED4;
                /*Erase the page*/
                erase_33E(source_addr.word.HW, source_addr.word.LW);
                write_PM(buffer, source_addr); /*program page */

                put_char(COMMAND_ACK); /*Send Acknowledgement */
                break;
            }
            case COMMAND_READ_ID:
            {
                ureg32_t temp;

                source_addr.val32 = 0xFF0000;
                temp.val32 = read_latch(source_addr.word.HW, source_addr.word.LW);
                write_buffer(&(temp.val[0]), 4);
                source_addr.val32 = 0xFF0002;
                temp.val32 = read_latch(source_addr.word.HW, source_addr.word.LW);
                write_buffer(&(temp.val[0]), 4);

                break;
            }	
            case COMMAND_RESET:
            case COMMAND_NACK:
            {
                reset_device();
                break;
            }
            default:
                put_char(COMMAND_NACK);
                break;
        }

