kcaluwae/dspic33e-bootloader/dspic_bootloader/bootloader.c
                                        /*Get the page contents*/
                                        for (i = 0; i < PM_ROW_SIZE * 3; i++) {
                                            buffer[i] = can_prog_data[i+3];
                                        }
                                        RGB_GREEN = !RGB_GREEN;
                                        RGB_RED = RGB_GREEN;
                                        erase_33E(source_addr.word.HW, source_addr.word.LW);
                                        write_PM(buffer, source_addr);
                                        
                                        can_send_sdo_download_segment_response(can_toggle_received);
                                    } else {
                                        /*wrong data size, abort*/
                                        can_receiving_prog_data = 0;
                                        can_send_SDO_abort(0x1F50,0x01,0x06070010);
                                        break;
                                    }
                                } else{
                                    /*Continue receiving data*/
                                    can_send_sdo_download_segment_response(can_toggle_received);
                                }
                            }
                            break;
                        case 1:
                            /*Initiate SDO download request (i.e. a write request)*/
                            can_receiving_prog_data = 0; /*If we receive an SDO download request during a program upload: ABORT */
                            switch(sdo_OD_idx){
                                case 0x1017:
                                    /*Heartbeat producer*/
                                    if(sdo_OD_sidx==0x00){
                                        /*Producer Heartbeat Time*/
                                        can_heartbeat_time = (can_msg_rec.data[4]&0xFF) | (((uint16_t) can_msg_rec.data[5]) << 8);
                                        /* Convert seconds into timer count value */
                                        delay_hb.val32 = (((uint32_t) (FCY)) / ((uint32_t) 1000)) * ((uint32_t) (can_heartbeat_time));
                                        T4CONbits.TON = 0;
                                        PR5 = delay_hb.word.HW;
                                        PR4 = delay_hb.word.LW;
                                        TMR5HLD = 0x0000;
                                        TMR4 = 0x0000;
                                        /* Enable Timer if HB time>0 */
                                        if(can_heartbeat_time>0){
                                            T4CONbits.TON = 1;
                                        }
                                        can_send_sdo_download_response(sdo_OD_idx,sdo_OD_sidx);
                                    } else {
                                        can_send_unsupported_OD(sdo_OD_idx,sdo_OD_sidx);
                                    }
                                    break;
                                case 0x1f50:
                                    /*Write program memory*/
                                    switch(sdo_OD_sidx){
                                        case 0x01:
                                            can_disable_boot_timeout = 1; /*Disable timeout once we start receiving program data*/
                                            /*Set up data structures for program memory upload*/
                                            can_receiving_prog_data = 1;

                                            can_prog_data_ctr = 0; //number of data bytes received
                                            //TODO: in the Canfestival implementation, the first 4 bytes contain the number of bytes to send
                                            //use this to check if the correct number of bytes has been received.
//                                            for(i=0;i<can_prog_data_ctr;++i){
//                                                can_prog_data[i] = can_msg_rec.data[4+i];
//                                            }
                                            //can_num_segments_ctr = 1;
                                            can_toggle = 0;
                                            can_send_sdo_download_response(sdo_OD_idx,sdo_OD_sidx);
                                            break;
                                        default:
                                           can_send_unsupported_OD(sdo_OD_idx,sdo_OD_sidx);
                                    };
                                case 0x1f51:
                                    /*Program Control*/
                                    switch(sdo_OD_sidx){
                                        case 0x01:
                                            /*Program control state: */   
                                            if(can_msg_rec.data[4] == 0x01){
                                                /*Writing a 1 to this object starts the main program*/
                                                can_send_sdo_download_response(sdo_OD_idx,sdo_OD_sidx);
                                                /*Wait until SDO response is transmitted*/
                                                while(C1TR01CONbits.TXREQ1 == 1);
                                                reset_device();
                                            } else if(can_msg_rec.data[4]==0x00){
                                                /*Writing 0 to this object disables the boot timeout timer*/
                                                can_disable_boot_timeout = 1;
                                                can_send_sdo_download_response(sdo_OD_idx,sdo_OD_sidx);
                                            }
                                            break;
                                        default:
                                            can_send_unsupported_OD(sdo_OD_idx,sdo_OD_sidx);
                                    };
                                    break;
                                default:
                                    can_send_unsupported_OD(sdo_OD_idx,sdo_OD_sidx);
                                    break;
                            };
                            break;
                        case 2:
                            /*Initiate SDO upload request (i.e. a read request)*/
                            can_receiving_prog_data = 0; /*If we receive an SDO upload request during a program upload: ABORT */
                            switch(sdo_OD_idx){
                                case 0x1000: /*Device type*/
                                    if(sdo_OD_sidx==0x00){
                                        /*Read device type information*/
                                        can_exp_buffer[0] = CAN_DEVICE_TYPE[3];//'t';
                                        can_exp_buffer[1] = CAN_DEVICE_TYPE[2];//'o';
                                        can_exp_buffer[2] = CAN_DEVICE_TYPE[1];//'o';
                                        can_exp_buffer[3] = CAN_DEVICE_TYPE[0];//'b';
                                        can_send_sdo_upload_response_expedited(sdo_OD_idx,sdo_OD_sidx, 0, can_exp_buffer);
                                    } else {
                                        can_send_unsupported_OD(sdo_OD_idx,sdo_OD_sidx);
                                    }
                                    break;
                                case 0x1001: /*Error registry*/
                                    if(sdo_OD_sidx==0x00){
                                        /*Read error registry*/
                                        can_exp_buffer[0] = 0; /*TODO: implement error registry values*/
                                        can_send_sdo_upload_response_expedited(sdo_OD_idx,sdo_OD_sidx, 3, can_exp_buffer);
                                    } else {
                                        can_send_unsupported_OD(sdo_OD_idx,sdo_OD_sidx);
                                    }
                                    break;
                                case 0x1017:
                                    /*Heartbeat producer*/
                                    if(sdo_OD_sidx==0x00){
                                        /*Producer Heartbeat Time*/
                                        can_exp_buffer[0] = can_heartbeat_time&0xFF;
                                        can_exp_buffer[1] = can_heartbeat_time>>8;
                                        can_send_sdo_upload_response_expedited(sdo_OD_idx,sdo_OD_sidx, 2, can_exp_buffer);
                                    } else {
                                        can_send_unsupported_OD(sdo_OD_idx,sdo_OD_sidx);
                                    }
                                    break;
                                case 0x1018: /*Identity*/
                                    switch(sdo_OD_sidx){
                                        case 0x00:
                                            /*Number of entries*/
                                            can_exp_buffer[0] = 4;
                                            can_send_sdo_upload_response_expedited(sdo_OD_idx,sdo_OD_sidx, 3, can_exp_buffer);
                                            break;
                                        case 0x01:
                                            /*Vendor ID*/
                                            can_exp_buffer[3] = CAN_VENDOR_ID[0];
                                            can_exp_buffer[2] = CAN_VENDOR_ID[1];
                                            can_exp_buffer[1] = CAN_VENDOR_ID[2];
                                            can_exp_buffer[0] = CAN_VENDOR_ID[3];
                                            can_send_sdo_upload_response_expedited(sdo_OD_idx,sdo_OD_sidx, 0, can_exp_buffer);
                                            break;
                                        case 0x02:
                                            /*Product code: read device id*/
                                            source_addr.val32 = 0xFF0000;
                                            temp.val32 = read_latch(source_addr.word.HW, source_addr.word.LW);
                                            can_exp_buffer[3] = temp.val[0];
                                            can_exp_buffer[2] = temp.val[1];
                                            can_exp_buffer[1] = temp.val[2];
                                            can_exp_buffer[0] = temp.val[3];
                                            can_send_sdo_upload_response_expedited(sdo_OD_idx,sdo_OD_sidx, 0, can_exp_buffer);
                                            break;
                                        case 0x03:
                                            /*Revision number*/
                                            can_exp_buffer[3] = CAN_REVISION_NUM[0];
                                            can_exp_buffer[2] = CAN_REVISION_NUM[1];
                                            can_exp_buffer[1] = CAN_REVISION_NUM[2];
                                            can_exp_buffer[0] = CAN_REVISION_NUM[3];
                                            can_send_sdo_upload_response_expedited(sdo_OD_idx,sdo_OD_sidx, 0, can_exp_buffer);
                                            break;
                                        case 0x04:
                                            /*Serial number*/
                                            can_exp_buffer[3] = CAN_SERIAL_NUMBER[0];
                                            can_exp_buffer[2] = CAN_SERIAL_NUMBER[1];
                                            can_exp_buffer[1] = CAN_SERIAL_NUMBER[2];
                                            can_exp_buffer[0] = CAN_SERIAL_NUMBER[3];
                                            can_send_sdo_upload_response_expedited(sdo_OD_idx,sdo_OD_sidx, 0, can_exp_buffer);
                                            break;
                                        default:
                                            can_send_unsupported_OD(sdo_OD_idx,sdo_OD_sidx);
                                    };
                                    break;
                                case 0x1f50:
                                    /*No support for reading the firmware, yet*/
                                    switch(sdo_OD_sidx){
                                        case 0x00:
                                            /*Number of entries*/
                                            can_exp_buffer[0] = 1;
                                            can_send_sdo_upload_response_expedited(sdo_OD_idx,sdo_OD_sidx, 3, can_exp_buffer);
                                            break;
                                        default:
                                            can_send_unsupported_OD(sdo_OD_idx,sdo_OD_sidx);
                                    };
                                    break;
                                case 0x1f51:
                                    /*Program Control*/
                                    switch(sdo_OD_sidx){
                                        case 0x00:
                                            /*Number of entries*/
                                            can_exp_buffer[0] = 1;
                                            can_send_sdo_upload_response_expedited(sdo_OD_idx,sdo_OD_sidx, 3, can_exp_buffer);
                                            break;
                                        case 0x01:
                                            /*Program control state: always 0 (we're in bootloader mode).*/
                                            /*TODO: This entry should read 1 in normal execution mode (main program).*/                                            can_exp_buffer[0] = 0x00;
                                            can_send_sdo_upload_response_expedited(sdo_OD_idx,sdo_OD_sidx, 3, can_exp_buffer);
                                            break;
                                        default:
                                            can_send_unsupported_OD(sdo_OD_idx,sdo_OD_sidx);
                                    };
                                    break;
                                default:
                                    /*unsupported OD*/
                                    can_send_unsupported_OD(sdo_OD_idx,sdo_OD_sidx);
                            };
                            break;
                        case 3:
                            /*SDO upload request (i.e. a continued read request)*/
                            can_receiving_prog_data = 0; /*If we receive an SDO download request during a program upload: ABORT */
                            can_send_unsupported_OD(sdo_OD_idx,sdo_OD_sidx);
                            break;
                    };
                }
                break;
            default:
                /* Error: restart the bootloader */
                asm("goto 0x800");
                Nop();
                Nop();
                Nop();
                break;
        };
        can_msg_transmitted = 0;
        can_msg_received = 0;
    }
#endif

