kcaluwae/dspic33e-bootloader/dspic_bootloader/bootloader.c
}

#ifdef BL_UART
/******************************************************************************/
void get_char(char * ptr_char) {
    while (1) {
        /* check timer expired*/
        if (IFS0bits.T3IF == 1) {
            *ptr_char = COMMAND_NACK;
            break;
        }
        /* check for UART receive errors */
        if (U2STAbits.FERR == 1) {
            continue;
        }

        /* must clear the overrun error to keep uart receiving */
        if (U2STAbits.OERR == 1) {
            U2STAbits.OERR = 0;
            continue;
        }

        /* get the data */
        if (U2STAbits.URXDA == 1) {
            T2CONbits.TON = 0; /* Disable timer countdown */
            *ptr_char = U2RXREG;
            break;
        }
    }
}

/******************************************************************************/
void put_char(char data) {
    while (!U2STAbits.TRMT);
    U2TXREG = data;
}



/******************************************************************************/

void write_buffer(char * ptr_data, int size) {
    unsigned i;
    for (i = 0; i < size; i++) {
        put_char(ptr_data[i]);
    }
}
#endif

/******************************************************************************/

void write_PM(char * ptrData, ureg32_t source_addr) {
#ifdef DOUBLE_WORD_WRITE
    ureg32_t temp[2];
    ureg32_t temp_addr;
    ureg32_t temp_data;
    unsigned i;

    for (i = 0; i < PM_ROW_SIZE; i += 2) {
        temp_addr.val32 = source_addr.val32 + (i<<1);
        temp[0].val[3] = 0; //phantom byte
        temp[0].val[2] = ptrData[i*3+2];
        temp[0].val[1] = ptrData[i*3+1];
        temp[0].val[0] = ptrData[i*3];
        temp[1].val[3] = 0; //phantom byte
        temp[1].val[2] = ptrData[i*3+5];
        temp[1].val[1] = ptrData[i*3+4];
        temp[1].val[0] = ptrData[i*3+3];
        write_pm_33E(temp_addr.word.HW, temp_addr.word.LW, temp);
    }
#else
    ureg32_t temp[128];
    ureg32_t temp_addr;
    ureg32_t temp_data;
    unsigned i,j;
    uint16_t row_offset;
    //write a single program word
    for(j=0;j<8;++j){
        row_offset = j<<7;
        for (i = 0; i < 128; i++) {
            temp[i].val[3] = 0; //phantom byte
            temp[i].val[2] = ptrData[i*3+2+row_offset];
            temp[i].val[1] = ptrData[i*3+1+row_offset];
            temp[i].val[0] = ptrData[i*3+row_offset];
        }
        temp_addr.val32 = source_addr.val32 + (row_offset<<1);
        write_row_pm_33E(temp_addr.word.HW, temp_addr.word.LW, temp);
    }
#endif
}

/******************************************************************************/



